["


Terms and Conditions

   
    Terms & conditions

Terms and Conditions

Welcome to Monarch Mart Ltd. We are an online marketplace and these are the terms and conditions governing your access and use of Monarch Mart along with its related sub-domains, sites, mobile app, services and other tools. By using the Site, you hereby accept these terms and conditions and represent that you agree to comply with these terms and conditions. 

Refund Timeline:

If any order is canceled, the payment against such order shall be refunded within 72 hours to 10 working days, but it may take longer time in exceptional cases that are related with other payment gateways, government authorities or any. Provided that received cash back, bonus, apology amount, gift amount, if any, will be adjusted with the refund amount when applied.

SECTION 1 – GENERAL CONDITIONS

By agreeing to these Terms of Service, you represent that you are at the age of majority in your present State or Province of residence, or that you have given us your consent to allow any of your minor dependents to use this website where you are the age of majority in your State or Province of residence.

You may not use our products for any illegal or unauthorized purpose nor may you in the use of the service, violate any laws in your jurisdiction. You must not transmit any worms or viruses or any code of a destructive nature. A breach or violation of any of the Terms will result in an immediate termination of your Services.
SECTION 2 – PRICING AND PAYMENT METHODS

All prices are subject to change without notification, and while every effort is made to ensure the accuracy of the prices displayed on Monarch Mart, they are not guaranteed to be accurate. If any price is different from that displayed we will inform you before dispatching the order and you will have the option of continuing with the order or not.

We are determined to provide the most accurate pricing information on the Site to our users; however, errors may still occur, such as cases when the price of an item is not displayed correctly on the Site. As such, we reserve the right to refuse or cancel any order. In the event that an item is mispriced, we may, at our own discretion, either contact you for instructions or cancel your order and notify you of such cancellation. We shall have the right to refuse or cancel any such orders whether or not the order has been confirmed and your pre-payment processed. If such a cancellation occurs on your prepaid order, our policies for refund will apply.

Choosing the right payment method is essential in order to shop with online stores. Monarch Mart is accepting payments in very easy and convenient ways. The chart of the payment methods of Monarch Mart is given below: 

Payment Method Condition

Cash on Delivery: For orders of any amount including delivery charge is applicable for cash on delivery.
Online Payment: Applicable for any ordered amount as per company policy.

Note: For orders more than BDT 2000 amount, customers need to make an advance payment of 10% of the total value. For higher valued items like Computers, refrigerators, Freezers, AC, Smartphones, Washing Machines, Gold and Diamond ornaments etc. customers need to pay the delivery charge in advance to confirm the orders. The delivery charge may vary depending on the weight of the product, delivery medium (third party logistics, transport, etc.) and delivery location.

SECTION 3 – ERRORS

Occasionally there may be visible information on our website or some Services containing typographical errors, inaccuracies or omissions that may relate to product descriptions, pricing, promotions, offers, product shipping charges and availability. We reserve the right to correct any errors, inaccuracies or omissions, and to change or update information or cancel orders if any information, on our or on any related website, is inaccurate at any time without prior knowledge. We are accepting emails if anyone finds any issue that needs to be taken care of about products, merchants, services or anything directly at hello@monarchmart.com for our immediate concern. 

"]
